In [1]:
#imports
import pandas as pd
import os
import csv
import numpy as np

In [2]:
#import file
data_file = os.path.join("Pymoli.csv")

In [3]:
#read file create df
pymoli_df = pd.read_csv(data_file)

In [4]:
#view some records to look at data structure
pymoli_df.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
#describe data
pymoli_df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [6]:
pymoli_df["SN"].count()

780

In [7]:
#count of unique users
unique_SN = pymoli_df["SN"].unique()
print(len(unique_SN))

576

In [8]:
# transactions
transac_count = pymoli_df["Item Name"].count()
print(transac_count)

780

In [9]:
#unique_items = pymoli_df["Item Name"].unique()
#print(unique_items)
#print(unique_items)
unique_ID = len(pymoli_df["Item ID"].unique())
print(unique_ID)

183

In [10]:
#Purchasing Analysis (Total)
#Run basic calculations to obtain number of unique items, average price, etc.  
unique_items = pymoli_df["Item ID"].unique()
print (len(unique_items))

183

In [11]:
#Run basic calculations to obtain number of unique items average price MATCHES "describe above"
avg_price = pymoli_df["Price"].mean()
avg_price

3.050987179487176

In [12]:
#Run basic calculations to obtain number of unique items average age  MATCHES "describe above"
avg_age = pymoli_df["Age"].mean()
avg_age

22.714102564102564

In [13]:
#Run basic calculations to obtain number of unique items average age  etc
gen_count = pymoli_df["Gender"].value_counts()
gen_count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [14]:
total_rev = pymoli_df["Price"].sum()
print(total_rev)

2379.77

In [15]:
summary_df =pd.DataFrame()
summary_df = pd.DataFrame([{"# of Transactions": transac_count,
                            "Total Unique Items": unique_ID,
                            "Avg. Price": avg_price,                            
                            "Total Revenue": total_rev,}])

summary_df["# of Transactions"] = summary_df["# of Transactions"]
summary_df["Total Unique Items"] = summary_df["Total Unique Items"]
summary_df["Avg. Price"] = summary_df["Avg. Price"]
summary_df["Total Revenue"] = summary_df["Total Revenue"]



summary_df

   # of Transactions  Total Unique Items  Avg. Price  Total Revenue
0                780                 183    3.050987        2379.77

In [16]:
#group by gender - display that it worked
pymoli2_df= pymoli_df.loc[:,["SN","Gender","Age"]]
pymoli2_df = pymoli2_df.drop_duplicates()

pymoli2_df
bygender_df = pymoli_df.groupby(['Gender'])
bygender_df["SN"].count().head(10)

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: SN, dtype: int64

In [17]:
#counting by gender
bygender_counts = pymoli2_df["Gender"].value_counts()
#gender count to df
gender_ct_df = bygender_counts.to_frame()
#gender_ct_df.head()
#calc % of each gender
Pct_calc = (gender_ct_df["Gender"] / gender_ct_df["Gender"].sum())*100
gender_ct_df.insert(1,"Pct of Players", Pct_calc)
gender_ct_df["Pct of Players"] = gender_ct_df["Pct of Players"].map("{:=,.2f}%".format)

In [18]:
gender_ct_df

                       Gender Pct of Players
Male                      484         84.03%
Female                     81         14.06%
Other / Non-Disclosed      11          1.91%

In [19]:
gender_total = pymoli_df.groupby(["Gender"]).sum()["Price"]
gender_mean = pymoli_df.groupby(["Gender"]).mean()["Price"]
gender_count = pymoli_df.groupby(["Gender"]).count()["Price"]
total_people = pymoli2_df.count()[0]
total_people
per_person = gender_total / total_people

In [20]:
per_person

Gender
Female                   0.628368
Male                     3.416042
Other / Non-Disclosed    0.087135
Name: Price, dtype: float64

In [21]:
Gender_Purc_df = pd.DataFrame({"Total Purchase Value": gender_total,
                            "Average Purchase Price": gender_mean,
                            "Purchase Count": gender_count,                            
                            "Avg Total Purchase per Person": per_person,})

Gender_Purc_df

,Total Purchase Value,Average Purchase Price,Purchase Count,Avg Total Purchase per Person
Gender,,,,
Female,361.94,3.203009,113,0.628368
Male,1967.64,3.017853,652,3.416042
Other / Non-Disclosed,50.19,3.346000,15,0.087135

In [22]:
#Establish bins for ages
#Categorize the existing players using the age bins. Hint: use pd.cut()
#Calculate the numbers and percentages by age group
#Create a summary data frame to hold the results
#Optional: round the percentage column to two decimal points
#Display Age Demographics Table

print(pymoli2_df["Age"].max())
print(pymoli2_df["Age"].min())

45
7

In [23]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 50]
group_labels=["below 10","11 to 14","15 to 19","20 to 24","25 to 29","30 to 34", "35 to 39", "over 40"]
print(bins)
print(group_labels)

[0, 9, 14, 19, 24, 29, 34, 39, 50]
['below 10', '11 to 14', '15 to 19', '20 to 24', '25 to 29', '30 to 34', '35 to 39', 'over 40']

In [24]:
pd.cut(pymoli2_df["Age"], bins, labels=group_labels)

0      20 to 24
1       over 40
2      20 to 24
3      20 to 24
4      20 to 24
         ...
773    20 to 24
774    11 to 14
775    20 to 24
777    20 to 24
778    below 10
Name: Age, Length: 576, dtype: category
Categories (8, object): [below 10 < 11 to 14 < 15 to 19 < 20 to 24 < 25 to 29 < 30 to 34 < 35 to 39 < over 40]

In [25]:
pymoli2_df["Age Group"] = pd.cut(pymoli2_df["Age"], bins, labels=group_labels)
pymoli2_df.head(5)

              SN Gender  Age Age Group
0        Lisim78   Male   20  20 to 24
1    Lisovynya38   Male   40   over 40
2     Ithergue48   Male   24  20 to 24
3  Chamassasya86   Male   24  20 to 24
4      Iskosia90   Male   23  20 to 24

In [26]:
byage_df = pymoli2_df.groupby(['Age Group'])
byage_df["SN"].count().head(10)

Age Group
below 10     17
11 to 14     22
15 to 19    107
20 to 24    258
25 to 29     77
30 to 34     52
35 to 39     31
over 40      12
Name: SN, dtype: int64

In [27]:
age_total = pymoli2_df.groupby(["Age Group"]).count()["Age"]
TotalAge = age_total.sum()
Age_order_pct = (age_total / TotalAge) * 100

In [28]:
print(age_total)

Age Group
below 10     17
11 to 14     22
15 to 19    107
20 to 24    258
25 to 29     77
30 to 34     52
35 to 39     31
over 40      12
Name: Age, dtype: int64

In [29]:
#Age Demographics
#Establish bins for ages
#Categorize the existing players using the age bins. Hint: use pd.cut()
#Calculate the numbers and percentages by age group
#Create a summary data frame to hold the results
#Optional: round the percentage column to two decimal points
#Display Age Demographics Table

byage_df = pymoli2_df.drop_duplicates()
byage_df = pd.DataFrame({"Total Count": age_total,
                            "Percent of Players": Age_order_pct,})

byage_df

           Total Count  Percent of Players
Age Group
below 10            17            2.951389
11 to 14            22            3.819444
15 to 19           107           18.576389
20 to 24           258           44.791667
25 to 29            77           13.368056
30 to 34            52            9.027778
35 to 39            31            5.381944
over 40             12            2.083333

In [30]:
#Purchasing Analysis (Age)
#Bin the purchase_data data frame by age
#Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below
#Create a summary data frame to hold the results
#Optional: give the displayed data cleaner formatting
#Display the summary data frame


    
#pd.cut(pymoli_df["Age"], bins, labels=group_labels)    
pymoli_df["Age Group"] = pd.cut(pymoli_df["Age"], bins, labels=group_labels)
pymoli_df.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20 to 24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,over 40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20 to 24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20 to 24
4,4,Iskosia90,23,Male,131,Fury,1.44,20 to 24

In [31]:
byage2_df = pymoli_df.groupby(['Age Group'])
Purch_Count = byage2_df.count()["Price"]
Total_Purch = byage2_df.sum()["Price"]
Avg_Purch = byage2_df.mean()["Price"]
Per_Person_Purch = Total_Purch / age_total

#byage2_df["Price"].count()

In [32]:
#byage2_df = pymoli2_df.drop_duplicates()
Age_Summary_df = pd.DataFrame({"Purchase Count": Purch_Count,
                            "Avg. Purchase Price": Avg_Purch,
                             "Total Purchase Value": Total_Purch,"Average Purchase Per Person": Per_Person_Purch
                              })
Age_Summary_df

,Purchase Count,Avg. Purchase Price,Total Purchase Value,Average Purchase Per Person
Age Group,,,,
below 10,23,3.353478,77.13,4.537059
11 to 14,28,2.956429,82.78,3.762727
15 to 19,136,3.035956,412.89,3.858785
20 to 24,365,3.052219,1114.06,4.318062
25 to 29,101,2.900990,293.00,3.805195
30 to 34,73,2.931507,214.00,4.115385
35 to 39,41,3.601707,147.67,4.763548
over 40,13,2.941538,38.24,3.186667

In [33]:
#Top Spenders
#Run basic calculations to obtain the results in the table below
#Create a summary data frame to hold the results
#Sort the total purchase value column in descending order
#Optional: give the displayed data cleaner formatting
#Display a preview of the summary data frame

In [34]:
bySN_df = pymoli_df.groupby(['SN'])
bySN_Total = bySN_df["Price"].sum()
bySN_avg = bySN_df["Price"].mean()
bySN_count = bySN_df["Price"].count()

In [35]:
bySN_df = pd.DataFrame({"# of Purchase": bySN_count,
                            "Avg. Purchase": bySN_avg,
                             "Total Purchase Value": bySN_Total
                              })

In [36]:
bySN_df.sort_values("Total Purchase Value",ascending=False)

             # of Purchase  Avg. Purchase  Total Purchase Value
SN
Lisosia93                5       3.792000                 18.96
Idastidru52              4       3.862500                 15.45
Chamjask73               3       4.610000                 13.83
Iral74                   4       3.405000                 13.62
Iskadarya95              3       4.366667                 13.10
...                    ...            ...                   ...
Ililsasya43              1       1.020000                  1.02
Irilis75                 1       1.020000                  1.02
Aidai61                  1       1.010000                  1.01
Chanirra79               1       1.010000                  1.01
Alo38                    1       1.000000                  1.00

[576 rows x 3 columns]

In [37]:
#Most Popular Items
#Retrieve the Item ID, Item Name, and Item Price columns
#Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value
#Create a summary data frame to hold the results
#Sort the purchase count column in descending order
#Optional: give the displayed data cleaner formatting
#Display a preview of the summary data frame

In [38]:
pymoli_3_df = pymoli_df.loc[:,["Item ID","Item Name", "Price"]]

In [39]:
Item_Group = pymoli_3_df.groupby(['Item ID',"Item Name"])

In [40]:
Item_count = Item_Group["Price"].count()
Item_price = Item_Group["Price"].mean()
Item_total = Item_Group["Price"].sum()
Item_total

Item ID  Item Name
0        Splinter                            5.12
1        Crucifer                            9.78
2        Verdict                            14.88
3        Phantomlight                       14.94
4        Bloodlord's Fetish                  8.50
                                            ...
179      Wolf, Promise of the Moonwalker    26.88
180      Stormcaller                         3.36
181      Reaper's Toll                       8.30
182      Toothpick                          12.09
183      Dragon's Greatsword                 3.27
Name: Price, Length: 183, dtype: float64

Item_count

In [41]:
item_df = pd.DataFrame({"Item Count": Item_count,
                            "Item Price": Item_price,
                             "Item Total": Item_total
                              })

In [42]:
item_df

                                         Item Count  Item Price  Item Total
Item ID Item Name
0       Splinter                                  4        1.28        5.12
1       Crucifer                                  3        3.26        9.78
2       Verdict                                   6        2.48       14.88
3       Phantomlight                              6        2.49       14.94
4       Bloodlord's Fetish                        5        1.70        8.50
...                                             ...         ...         ...
179     Wolf, Promise of the Moonwalker           6        4.48       26.88
180     Stormcaller                               1        3.36        3.36
181     Reaper's Toll                             5        1.66        8.30
182     Toothpick                                 3        4.03       12.09
183     Dragon's Greatsword                       3        1.09        3.27

[183 rows x 3 columns]

In [43]:
#Most Profitable Items
#Sort the above table by total purchase value in descending order
#Optional: give the displayed data cleaner formatting
#Display a preview of the data frame

In [44]:

item_df = item_df.sort_values("Item Total",ascending=False)
item_df.head()

,,Item Count,Item Price,Item Total
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80